---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelText
source: html/a66b94b9-d249-3d1d-07fe-9c4038ed1a5c.htm
---
# ModelText Properties

The id of the assembly instance to which the element belongs.